export const root = document.getElementById('root');

export const mobileWidth = window.matchMedia(`(max-width: 600px)`);
export const tabletWidth = window.matchMedia(`(min-width: 600px)`);
export const desktopWidth = window.matchMedia(`(min-width: 1000px)`);

export const boolean = true;

export const container = root.childNodes[0];

export const textIllust = 'If you’re curious about my story, </br>please read it to the end </br> even if you feel bored.';


export const textIAm ='나는 이누리 입니다.</br>나는 El mundo이기도 합니다.</br>나는 1991년 10월 31일 生 입니다.</br>나는 대전 토박이입니다.';

export const textILike ='나는 집에 있는 것을 좋아합니다.</br>그렇지만 나는 여행다니는 것도 좋아합니다. </br> 나는 한가할때 그림그리는것을 좋아합니다.</br> 나는 생각이 많을 때 음악을 들으며 걷는 것을 좋아합니다.</br>나는 동물들을 좋아합니다. 특히 고양이를 많이 좋아합니다.</br>나는 호기심이 많아 새롭게 배우는것을 좋아합니다.';

export const textIDid ='나는 어렸을때 부터 미술에 관심이 많았습니다.</br> 그리고 나는 일본어에 관심이 생겼습니다.</br> 그래서 일본어 전공을 선택했고 일본에서 대학을 졸업했습니다.</br> 졸업후 한국에서 대학교 조교로 일하기도 했습니다.</br>그 후 일본에서 취업하기로 마음먹고 대학교 전공을 살려 3년간 일본의 호텔에서 일했습니다.</br>나는 학교와 호텔에서 일한 경험을 통해 사람을 대하는 법을 배웠습니다.   ';

export const nowI1 ='나는 지금 웹디자이너가 되기 위해 공부를 하고 있습니다.</br> 코로나로 인해 더이상 일본에서 일하기가 힘들었습니다. 그래서 나는 한국으로 돌아왔습니다. 한국으로 돌아와보니 일본어의 비전이 없다고 생각했습니다. 그래서 나는 미래에 나에게 도움이 될 수 있는 ‘기술’을 새롭게 배워야겠다고 마음먹었습니다.';

export const nowI2 ='Web에 문외한이였던 나는 지금 HTML문서를 만들수 있습니다. CSS,SCSS를 사용한 스타일링도 가능하게 되었습니다. 그리고 JavaScript를 사용한 문서의 동적제어를 할 수 있게 되었습니다. 아직 부족한 부분이 많지만 더 나은 나를 만들기 위해서 배움을 멈추지 않고 있습니다.';

export const project1Text = '여행을 좋아하기때문에 여행과 관련한 콘텐츠를 만들고 싶었습니다. 나는 계획하는 것을 좋아하는데 모든 사람들이 그렇지않다는것을 알았습니다. 그래서 이 프로젝트는 그런사람들에게 도움이 되고자 시작하게 되었습니다.  실제 서비스를 하겠다는 마음가짐으로 시작하여 가상의 페르소나도 만들고, SWOT분석과 소비자 여정지도까지 고려해 가며 제작하였습니다.  컨텐츠의 주제가 일본여행 이기 때문에 일본하면 생각나는 ‘벚꽃’을 테마로 하였습니다. 또한 정보를 제공해주는 콘텐츠로 정보전달의 목적에 충실할 수 있도록 익숙한 레이아웃 디자인을 선택하였습니다.';

export const project2Text ='두번째 프로젝트는 조금더 개인적인 작업물로 좋아하는가수에 대한 콘텐츠를 만들고 싶었습니다. 좀더 많은 사람들이 그룹의 음악을 들어줬으면 하는 마음에서 시작하게된 작업이지만 개인적인 작업이어도 소비자 타겟을생각하고 반응 예측을 하며 진행하였습니다. 그룹의 팬덤의 색을 테마로 하였고 생소할 수 있는 음악장르이기 때문에 소비자들의호기심을 최대한 유발할 수있도록 많은 이미지와 영상을 배치 하였습니다.';

export const somedayText1 ='언젠가 나는 다른 언어를 배워서 앞으로 만들어갈 컨텐츠에 적용해보고 싶습니다. </br>일본어 뿐만 아니라 영어, 스페인어 같이 외국어를 다양하게 해서 조금더 글로벌한 인재가 되고 싶습니다. </br> 언젠가 나는 내가 작업한 컨텐츠를 많은 사람들이 이용할  수 있도록 하고 싶습니다.';

export const somedayText2 ='나는 새롭게 배우는 기술을 통해 전 세계와 소통할 수 있는 전 세계를 여행하며 일하는 웹디자이너, 웹퍼블리셔가 되는 것이 나의 최종 꿈 입니다.';

export const contactText = '이 이야기는 여기서 끝이 아닙니다. </br> 그러니까 나는 이 이야기를 계속 써내려갈 것입니다. </br> 그래서 나는 배우는 것을 멈추지 않을 것입니다. </br> 100세시대에서 살아가는 사람으로서 배울 수 있는게 많이 있다는 것은 행운이라고 생각합니다. </br> 앞으로 어떤 내용의 이야기를 써내려갈지 지켜봐 주시면 감사하겠습니다. ';

export const contentText1 = '나는 입니다.</br>나는 좋아합니다.</br>나는 했습니다.';

export const contentText2 = '나는 지금 합니다.';

export const contentText3 = '이것은 나의 프로젝트 입니다.</br>나는 이렇게 만들었습니다.</br>프로젝트';

export const contentText4 = '언젠가 나는 하고싶습니다.</br>나의 최종 꿈은 ... 입니다.';
export const contentText5 = '그러니까 나는</br>연락하고 싶다면</br>Resume';

export const pcProjectText1 = '여행을 좋아하기때문에 여행과 관련한 콘텐츠를 만들고 싶었습니다. </br>나는 계획하는 것을 좋아하는데 모든 사람들이 그렇지않다는것을 알았습니다.</br> 그래서 이 프로젝트는 그런사람들에게 도움이 되고자 시작하게 되었습니다. </br> 실제 서비스를 하겠다는 마음가짐으로 시작하여 가상의 페르소나도 만들고, SWOT분석과 소비자 여정지도까지 고려해 가며 제작하였습니다.'; 

export const pcProjectText2 = '컨텐츠의 주제가 일본여행 이기 때문에 일본하면 생각나는 ‘벚꽃’을 테마로 하였습니다.</br> 또한 정보를 제공해주는 콘텐츠로 정보전달의 목적에 충실할 수 있도록 익숙한 레이아웃 디자인을 선택하였습니다.';

export const pcProject2Text ='두번째 프로젝트는 조금더 개인적인 작업물로 좋아하는가수에 대한 콘텐츠를 만들고 싶었습니다.</br> 좀더 많은 사람들이 그룹의 음악을 들어줬으면 하는 마음에서 시작하게된 작업이지만 개인적인 작업이어도 소비자 타겟을생각하고 반응 예측을 하며 진행하였습니다. </br> 그룹의 팬덤의 색을 테마로 하였고 생소할 수 있는 음악장르이기 때문에 소비자들의 호기심을 최대한 유발할 수있도록 많은 이미지와 영상을 배치 하였습니다.'