export const root = document.getElementById('root');

export const mobileWidth = window.matchMedia(`(max-width: 600px)`);
export const tabletWidth = window.matchMedia(`(min-width: 600px)`);
export const desktopWidth = window.matchMedia(`(min-width: 1080px)`);

export const boolean = true;

export const container = root.childNodes[0];

export const textIAm ='나는 이누리 입니다.</br>나는 El mundo이기도 합니다.</br>나는 1991년 10월 31일 生 입니다.</br>나는 대전 토박이입니다.';

export const textILike ='나는 집에 있는 것을 좋아합니다.</br>그렇지만 나는 여행다니는 것도 좋아합니다. 나는 한가할때 그림그리는것을 좋아합니다. 나는요리하고  만든 요리를 다같이 나눠먹는 것을 좋아합니다. 나는 생각이 많을 때 음악을 들으며 걷는 것을 좋아합니다.</br>나는 동물들을 좋아합니다. </br>특히 고양이를 많이 좋아합니다.</br>나는 호기심이 많아 새롭게 배우는것을 좋아합니다.';

export const textIDid ='나는 어렸을때부터 미술과 음악에 관심이 많았습니다.</br>나는 종종 대회에 나가면 상을 타곤 했습니다.</br>청소년기에 들어서 나는 일본에 관심이 생겼습니다.</br>그래서 나는 일본어 전공을 선택했습니다.</br>덕분에 나는 일본에서 대학을 졸업했습니다. </br>나는 졸업 후 대학교 학과사무실에서 조교로 일했습니다.</br>나는 조교일을 마치고 일본에 취업하기로 했습니다.</br>일본 대학의 전공을 살려 약 3년간 일본의 호텔에서 일했습니다.</br>학교와 호텔에서 일하면서 나는 사람을 대하는법을 배웠습니다.';

export const nowI1 ='나는 지금 웹디자이너가 되기 위해 공부를 하고 있습니다.</br>나는 코로나로 인해 더이상 일본에서 일하기가 힘들었습니다. 그래서 나는 한국으로 돌아왔습니다. 한국으로 돌아오고 나니 일본어의 비전이 없다고 생각했습니다. 그래서 나는 미래에 나에게 도움이 될 수 있는 ‘기술’을 새롭게 배워야겠다고 마음먹었습니다.';

export const nowI2 ='Web에 문외한이였던 나는 지금 HTML문서를 만들수 있습니다. CSS,SCSS를 사용한 스타일링도 가능하게 되었습니다. 그리고 JavaScript를 사용한 문서의 동적제어를 할 수 있게 되었습니다. 아직 부족한 부분이 많지만 더 나은 나를 만들기 위해서 배움을 멈추지 않고 있습니다.';

export const project1Text = '여행을 좋아하기때문에 여행과 관련한 콘텐츠를 만들고 싶었습니다. 나는 계획하는 것을 좋아하는데 모든 사람들이 그렇지않다는것을 알았습니다. 그래서 이 프로젝트는 그런사람들에게 도움이 되고자 시작하게 되었습니다.  실제 서비스를 하겠다는 마음가짐으로 시작하여 가상의 페르소나도 만들고, SWOT분석과 소비자 여정지도까지 고려해 가며 제작하였습니다.  컨텐츠의 주제가 일본여행 이기 때문에 일본하면 생각나는 ‘벚꽃’을 테마로 하였습니다.또한 정보를 제공해주는 콘텐츠로 정보전달의 목적에 충실할 수 있도록 익숙한 레이아웃 디자인을 선택하였습니다.';